"""
前缀和与差分
同时也常用于操作转换(区间转单点,单点转区间)
"""

"""
一维前缀和
"""
a=[1,5,2,3,2]
b=[0]
for i in a:
    b.append(b[-1]+i)
# 求区间[i,j]
j,i=3,1
print(b[j+1]-b[i])

"""
一维差分
给区间[l, r]中的每个数加上c:
b[l] += c, b[r + 1] -= c
"""

"""
二维前缀和
b[i, j] = 第i行j列格子左上部分所有元素的和
b[i][j]=b[i-1][j]+b[i][j-1]-b[i-1][j-1]+a[i][j]
以(x1, y1)为左上角，(x2, y2)为右下角的子矩阵的和为：
b[x2][y2] - b[x1 - 1][y2] - b[x2][y1 - 1] + b[x1 - 1][y1 - 1]
"""
a = [[1, 2, 3],
     [4, 5, 6],
     [7, 8, 9]]
m, n = len(a), len(a[0])
b = [[0] * (n+1) for _ in range(m+1)]
for i in range(1, m+1):
    for j in range(1, n+1):
        b[i][j] = a[i-1][j-1] + b[i-1][j] + b[i][j-1] - b[i-1][j-1]
